//
//  DataManager.swift
//  CheckTest
//
//  Created by Masaie on 27/3/22.
//

import Foundation

class DataManager {
    
    static let shared = DataManager()
    
    let titles = [
        "Какого устройства нет в блоке БУФТ?",
        "Как на схемах обозначается кран НМ БУФТ?",
        "Как на схемах обозначается кран РВТБ?",
        "Какое  обозначение на вагоне имеет кран БУСТ?",
        "Вид подвески тягового привода?",
        "Выход штока ТЦ в эксплуатации не должен превышать?",
        "Какая страховка от падения редуктора на путь?",
        "Какой профиль катания колеса?",
        "При каком напряжении в контактной сети отключается БВ?",
        "Светофор МР-1 на ст. «Марксистская» по назначению?"
    ]
    
    let answers = [
        ["АДУВ", "БУСТ", "ВР"],
        ["Пионер350", "Ореон350", "Jarex300"],
        ["Toshiba One", "Toshiba 1", "T-1"],
        ["К-8", "К-22", "К-9"],
        ["Независимая", "Опорно-осевая", "Рамная"],
        ["15 мм.", "20 мм.", "13 мм."],
        ["Трос", "Вилка", "Трос и вилка"],
        ["1/10 и 1/5", "1/15 и 1/6", "1/20 и 1/7"],
        ["Менее 650В", "Менее 630В", "Менее 550В"],
        ["Входной", "Выходной", "Маневровый"]
    ]
    
    let correctAnswers = [
        "БУСТ",
        "Jarex300",
        "Toshiba 1",
        "К-22",
        "Независимая",
        "13 мм",
        "Вилка",
        "1/15 и 1/6",
        "Менее 650В",
        "Маневровый"
    ]
    
    private init() {}
}
